app/controllers/admin/admins_controller.rb

  def create
    @admin = Admin.new(params[:admin].merge({level: 1}))
    if @admin.save
---
INSERT INTO `admins` (`created_at`, `level`, `login`, `password`, `updated_at`) VALUES ('2015-06-09 08:17:24', 0, '', '', '2015-06-09 08:17:24')

  def find_admin
    @admin = Admin.find_by_id(params[:id])
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1