app/controllers/admin/orders_controller.rb

  def index
    @search = Order.order("status asc,id desc").search(params[:search])
    @orders = @search.page(params[:page])
---
SELECT COUNT(*) FROM `orders` WHERE `orders`.`status` = 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`status` = 2 ORDER BY status asc,id desc LIMIT 3 OFFSET 0

  def update
    @order = Order.find_by_id(params[:id])
    return redirect_to admin_orders_path, notice: '订单不存在' unless @order
    @order.update_attributes(status: params[:status], update_author: @current_user.login)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 21 LIMIT 1
UPDATE `orders` SET `status` = 1, `update_author` = 'admin', `updated_at` = '2015-06-08 09:49:17' WHERE `orders`.`id` = 20