app/controllers/admin/sessions_controller.rb

  def create
    admin = Admin.find_by_login_and_password(params[:login], params[:password])
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`login` = 'admin' AND `admins`.`password` = '123' LIMIT 1