app/views/admin/orders/index.html.erb

          <span class="se-name">城市:</span>
          <%= f.select :city_equals, Order.city_options, { include_blank: '' } %>
---
SELECT `orders`.* FROM `orders` ORDER BY id desc