app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])
    if @order.save
---
INSERT INTO `orders` (`address_end`, `address_start`, `car_type`, `city`, `created_at`, `memo`, `name`, `status`, `tel`, `total_price`, `update_author`, `updated_at`) VALUES ('张东路2281(上海市浦东新区)', '江湾体育场(地铁10号线)', 3, 1, '2015-06-08 08:29:43', '', '迟迟', 0, '只运送两厢啤酒\r\n先到张江软件园放下一箱\r\n然后运一箱到终点', '112.0', NULL, '2015-06-08 08:29:43')